# Напишите программу в которй пользователь будет задавать
# две строки, программа определять количество вхождений одной
# строк в другую

a=input()
b=input()

print(a.count(b))

