# напишите программу, которая принимает
# на вход число N  и выдает последовательность
# из N  членов

n= int(input())
# list=[]
# for i in range(n):
#     x=(-3)**i
#     list.append(x)
# print(list)    
for i in range(5):
    print((-3)**i,end=' ')